package com.example.user.application.food;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;

/**
 * Created by user on 15. 8. 13.
 */
public class FoodParser {
    final String json = "[{\"주된음식\":\"가마솥곰탕, 수육\",\"연락처\":\"02-502-5895\",\"경도\":\"126.9843342\",\"위도\":\"37.4162366\",\"상호명\":\"가마솥회관\",\"소재지도로명주소\":\"경기도 과천시  과천대로 161 (갈현동)\"}," +
            "{\"주된음식\":\"복지리, 복만두전골, 복탕\",\"연락처\":\"02-504-1626\",\"경도\":\"126.9920458\",\"위도\":\"37.4277596\",\"상호명\":\"해원복집\",\"소재지도로명주소\":\"경기도 과천시  별양상가로 2 (별양동)\"}," +
            "{\"주된음식\":\"생불고기, 설렁탕\",\"연락처\":\"02-507-3001\",\"경도\":\"126.9925064\",\"위도\":\"37.4275469\",\"상호명\":\"높은기와집\",\"소재지도로명주소\":\"경기도 과천시  별양상가1로 18 (별양동)\"}," +
            "{\"주된음식\":\"생고기(안창살)게장백\",\"연락처\":\"02-504-4200\",\"경도\":\"126.9920458\",\"위도\":\"37.4277596\",\"상호명\":\"관악산가든\",\"소재지도로명주소\":\"경기도 과천시  별양상가로 2 (별양동)\"}," +
            "{\"주된음식\":\"중화요리\",\"연락처\":\"02-502-9111\",\"경도\":\"126.9892375\",\"위도\":\"37.4282679\",\"상호명\":\"월량\",\"소재지도로명주소\":\"경기도 과천시  통영로 5 (중앙동)\"}," +
            "{\"주된음식\":\"튀김, 빵\",\"연락처\":\"02-507-2423\",\"경도\":\"127.0240332\",\"위도\":\"37.4361122\",\"상호명\":\"롯데리아서울랜드\",\"소재지도로명주소\":\"경기도 과천시  광명로 181 (막계동)\"}," +
            "{\"주된음식\":\"부대찌개\",\"연락처\":\"02-507-0701\",\"경도\":\"126.9920034\",\"위도\":\"37.4269764\",\"상호명\":\"놀부부대찌개\",\"소재지도로명주소\":\"경기도 과천시  별양상가1로 10 (별양동)\"}," +
            "{\"주된음식\":\"경양식\",\"연락처\":\"02-507-0773\",\"경도\":\"127.0293037\",\"위도\":\"37.4514053\",\"상호명\":\"스위티하우스\",\"소재지도로명주소\":\"경기도 과천시  돌무개길 14-19 (주암동)\"}," +
            "{\"주된음식\":\"샤브샤브, 생등심\",\"연락처\":\"02-502-8384\",\"경도\":\"126.9920458\",\"위도\":\"37.4277596\",\"상호명\":\"서라벌\",\"소재지도로명주소\":\"경기도 과천시  별양상가로 2 (별양동)\"}," +
            "{\"주된음식\":\"사시미, 초밥\",\"연락처\":\"02-503-1616\",\"경도\":\"126.9920458\",\"위도\":\"37.4277596\",\"상호명\":\"청도일식\",\"소재지도로명주소\":\"경기도 과천시  별양상가로 2 (별양동)\"}]";

    public ArrayList<Food> jsonParser() {
        ArrayList<Food> list = new ArrayList<Food>();
        try {
            //JSON String으로 부터 JSONArray 생성. [](대괄호)
            JSONArray jArr = new JSONArray(json);
            for (int i = 0; i < jArr.length(); i++) {
                //JSONArray에서 i번째 해당하는 JSONObject를 추출.
                JSONObject jObj = jArr.getJSONObject(i);
                Food food = new Food();
                //각 이름("id"/"tel")에 해당하는 값을 추출.
                food.setName(jObj.getString("상호명"));
                food.setAddr(jObj.getString("소재지도로명주소"));
                food.setClcdnm(jObj.getString("주된음식"));
                food.setTelno(jObj.getString("연락처"));
                food.setxPos(Double.valueOf(jObj.getString("경도")));
                food.setyPos(Double.valueOf(jObj.getString("위도")));
                list.add(food);
            }
        } catch (JSONException e) {
            e.printStackTrace();
        }
        return list;
    }
}