package com.example.user.application.lodge;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;

/**
 * Created by user on 15. 8. 13.
 */
public class LodgeParser {
    final String json = "[{\"시설유형\":\"팬션\",\"연락처\":\"031-572-2345\",\"경도\":\"127.1459612\",\"위도\":\"37.6488322\",\"업소명\":\"태성여관\",\"소재지지번주소\":\"경기도 남양주시 퇴계원면 퇴계원리 229번지 14호\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-528-1513\",\"경도\":\"127.1091377\",\"위도\":\"37.6492581\",\"업소명\":\"경기여관\",\"소재지지번주소\":\"경기도 남양주시 별내동 695번지 5호외 1필지\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-592-5227\",\"경도\":\"127.2088982\",\"위도\":\"37.6345097\",\"업소명\":\"청자여인숙\",\"소재지지번주소\":\"경기도 남양주시 금곡동 419번지\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-573-8560\",\"경도\":\"127.1805175\",\"위도\":\"37.6556737\",\"업소명\":\"한일여인숙\",\"소재지지번주소\":\"경기도 남양주시 진건읍 용정리 794번지\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-591-3917\",\"경도\":\"127.2060352\",\"위도\":\"37.6349482\",\"업소명\":\"서래장여관\",\"소재지지번주소\":\"경기도 남양주시 금곡동 404번지 11호\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-593-9005\",\"경도\":\"127.3086094\",\"위도\":\"37.6522538\",\"업소명\":\"현대여관\",\"소재지지번주소\":\"경기도 남양주시 화도읍 마석우리 292번지 22호\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-577-1901\",\"경도\":\"127.2116907\",\"위도\":\"37.5878817\",\"업소명\":\"신정여관\",\"소재지지번주소\":\"경기도 남양주시 와부읍 덕소리 462번지\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-594-0301\",\"경도\":\"127.3086094\",\"위도\":\"37.6522538\",\"업소명\":\"대성여관\",\"소재지지번주소\":\"경기도 남양주시 화도읍 마석우리 292번지 4호\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-572-3453\",\"경도\":\"127.1844424\",\"위도\":\"37.7201582\",\"업소명\":\"에이스여관\",\"소재지지번주소\":\"경기도 남양주시 진접읍 장현리 351번지 26호\"}," +
            "{\"시설유형\":\"팬션\",\"연락처\":\"031-527-7079\",\"경도\":\"127.2041298\",\"위도\":\"37.7453191\",\"업소명\":\"광산장여관\",\"소재지지번주소\":\"경기도 남양주시 진접읍 팔야리 781번지 1호\"}]";

    public ArrayList<Lodge> jsonParser() {
        ArrayList<Lodge> list = new ArrayList<Lodge>();
        try {
            //JSON String으로 부터 JSONArray 생성. [](대괄호)
            JSONArray jArr = new JSONArray(json);
            for (int i = 0; i < jArr.length(); i++) {
                //JSONArray에서 i번째 해당하는 JSONObject를 추출.
                JSONObject jObj = jArr.getJSONObject(i);
                Lodge lodge = new Lodge();
                //각 이름("id"/"tel")에 해당하는 값을 추출.
                lodge.setName(jObj.getString("업소명"));
                lodge.setAddr(jObj.getString("소재지지번주소"));
                lodge.setClcdnm(jObj.getString("시설유형"));
                lodge.setTelno(jObj.getString("연락처"));
                lodge.setxPos(Double.valueOf(jObj.getString("경도")));
                lodge.setyPos(Double.valueOf(jObj.getString("위도")));
                list.add(lodge);
            }
        } catch (JSONException e) {
            e.printStackTrace();
        }
        return list;
    }
}